app/controllers/projects_controller.rb

  def index
    @projects = current_user.projects.page(params[:page])
---
SELECT COUNT(*) FROM `projects` INNER JOIN `users_projects_profiles` ON `projects`.`id` = `users_projects_profiles`.`project_id` WHERE `users_projects_profiles`.`user_id` = 3
SELECT `projects`.* FROM `projects` INNER JOIN `users_projects_profiles` ON `projects`.`id` = `users_projects_profiles`.`project_id` WHERE `users_projects_profiles`.`user_id` = 3 LIMIT 10 OFFSET 0