app/controllers/users/omniauth_callbacks_controller.rb

SELECT `users`.* FROM `users` WHERE (email = 'danielb_leal@outlook.com') ORDER BY `users`.`id` ASC LIMIT 1
---
	def facebook
    # You need to implement the method below in your model (e.g. app/models/user.rb)
    @user = User.find_for_facebook_oauth(request.env["omniauth.auth"], current_user)

SELECT `users`.* FROM `users` WHERE (email = NULL) ORDER BY `users`.`id` ASC LIMIT 1
---
  def twitter
  	auth = env["omniauth.auth"]
    #Rails.logger.info("auth is **************** #{auth.to_yaml}")
    @user = User.find_for_twitter_oauth(request.env["omniauth.auth"], current_user)